grevaillot/svd_tools/headers/STM32F7x9/mdios.h
/** @defgroup mdios_mdios_cr MDIOSCR MDIOS configuration register
@{*/


#define MDIOS_MDIOS_CR_PORT_ADDRESS_SHIFT		8
#define MDIOS_MDIOS_CR_PORT_ADDRESS_MASK		0x1f
/** @defgroup mdios_mdios_cr_port_address PORTADDRESS Slaves's address
@{*/
/**@}*/

/** MDIOS_MDIOS_CR_DPC Disable Preamble Check **/
#define MDIOS_MDIOS_CR_DPC		(1 << 7)
/** MDIOS_MDIOS_CR_EIE Error interrupt enable **/
#define MDIOS_MDIOS_CR_EIE		(1 << 3)
/** MDIOS_MDIOS_CR_RDIE Register Read Interrupt Enable **/
#define MDIOS_MDIOS_CR_RDIE		(1 << 2)
/** MDIOS_MDIOS_CR_WRIE Register write interrupt enable **/
#define MDIOS_MDIOS_CR_WRIE		(1 << 1)
/** MDIOS_MDIOS_CR_EN Peripheral enable **/
#define MDIOS_MDIOS_CR_EN		(1 << 0)

/**@}*/

/** @defgroup mdios_mdios_wrfr MDIOSWRFR MDIOS write flag register
@{*/


#define MDIOS_MDIOS_WRFR_WRF_SHIFT		0
#define MDIOS_MDIOS_WRFR_WRF_MASK		0xffffffff
/** @defgroup mdios_mdios_wrfr_wrf WRF Write flags for MDIO registers 0 to 31
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_cwrfr MDIOSCWRFR MDIOS clear write flag register
@{*/


#define MDIOS_MDIOS_CWRFR_CWRF_SHIFT		0
#define MDIOS_MDIOS_CWRFR_CWRF_MASK		0xffffffff
/** @defgroup mdios_mdios_cwrfr_cwrf CWRF Clear the write flag
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_rdfr MDIOSRDFR MDIOS read flag register
@{*/


#define MDIOS_MDIOS_RDFR_RDF_SHIFT		0
#define MDIOS_MDIOS_RDFR_RDF_MASK		0xffffffff
/** @defgroup mdios_mdios_rdfr_rdf RDF Read flags for MDIO registers 0 to 31
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_crdfr MDIOSCRDFR MDIOS clear read flag register
@{*/


#define MDIOS_MDIOS_CRDFR_CRDF_SHIFT		0
#define MDIOS_MDIOS_CRDFR_CRDF_MASK		0xffffffff
/** @defgroup mdios_mdios_crdfr_crdf CRDF Clear the read flag
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_sr MDIOSSR MDIOS status register
@{*/

/** MDIOS_MDIOS_SR_TERF Turnaround error flag **/
#define MDIOS_MDIOS_SR_TERF		(1 << 2)
/** MDIOS_MDIOS_SR_SERF Start error flag **/
#define MDIOS_MDIOS_SR_SERF		(1 << 1)
/** MDIOS_MDIOS_SR_PERF Preamble error flag **/
#define MDIOS_MDIOS_SR_PERF		(1 << 0)

/**@}*/

/** @defgroup mdios_mdios_clrfr MDIOSCLRFR MDIOS clear flag register
@{*/

/** MDIOS_MDIOS_CLRFR_CTERF Clear the turnaround error flag **/
#define MDIOS_MDIOS_CLRFR_CTERF		(1 << 2)
/** MDIOS_MDIOS_CLRFR_CSERF Clear the start error flag **/
#define MDIOS_MDIOS_CLRFR_CSERF		(1 << 1)
/** MDIOS_MDIOS_CLRFR_CPERF Clear the preamble error flag **/
#define MDIOS_MDIOS_CLRFR_CPERF		(1 << 0)

/**@}*/

/** @defgroup mdios_mdios_dinr0 MDIOSDINR0 MDIOS input data register 0
@{*/


#define MDIOS_MDIOS_DINR0_DIN0_SHIFT		0
#define MDIOS_MDIOS_DINR0_DIN0_MASK		0xffff
/** @defgroup mdios_mdios_dinr0_din0 DIN0 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr1 MDIOSDINR1 MDIOS input data register 1
@{*/


#define MDIOS_MDIOS_DINR1_DIN1_SHIFT		0
#define MDIOS_MDIOS_DINR1_DIN1_MASK		0xffff
/** @defgroup mdios_mdios_dinr1_din1 DIN1 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr2 MDIOSDINR2 MDIOS input data register 2
@{*/


#define MDIOS_MDIOS_DINR2_DIN2_SHIFT		0
#define MDIOS_MDIOS_DINR2_DIN2_MASK		0xffff
/** @defgroup mdios_mdios_dinr2_din2 DIN2 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr3 MDIOSDINR3 MDIOS input data register 3
@{*/


#define MDIOS_MDIOS_DINR3_DIN3_SHIFT		0
#define MDIOS_MDIOS_DINR3_DIN3_MASK		0xffff
/** @defgroup mdios_mdios_dinr3_din3 DIN3 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr4 MDIOSDINR4 MDIOS input data register 4
@{*/


#define MDIOS_MDIOS_DINR4_DIN4_SHIFT		0
#define MDIOS_MDIOS_DINR4_DIN4_MASK		0xffff
/** @defgroup mdios_mdios_dinr4_din4 DIN4 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr5 MDIOSDINR5 MDIOS input data register 5
@{*/


#define MDIOS_MDIOS_DINR5_DIN5_SHIFT		0
#define MDIOS_MDIOS_DINR5_DIN5_MASK		0xffff
/** @defgroup mdios_mdios_dinr5_din5 DIN5 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr6 MDIOSDINR6 MDIOS input data register 6
@{*/


#define MDIOS_MDIOS_DINR6_DIN6_SHIFT		0
#define MDIOS_MDIOS_DINR6_DIN6_MASK		0xffff
/** @defgroup mdios_mdios_dinr6_din6 DIN6 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr7 MDIOSDINR7 MDIOS input data register 7
@{*/


#define MDIOS_MDIOS_DINR7_DIN7_SHIFT		0
#define MDIOS_MDIOS_DINR7_DIN7_MASK		0xffff
/** @defgroup mdios_mdios_dinr7_din7 DIN7 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr8 MDIOSDINR8 MDIOS input data register 8
@{*/


#define MDIOS_MDIOS_DINR8_DIN8_SHIFT		0
#define MDIOS_MDIOS_DINR8_DIN8_MASK		0xffff
/** @defgroup mdios_mdios_dinr8_din8 DIN8 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr9 MDIOSDINR9 MDIOS input data register 9
@{*/


#define MDIOS_MDIOS_DINR9_DIN9_SHIFT		0
#define MDIOS_MDIOS_DINR9_DIN9_MASK		0xffff
/** @defgroup mdios_mdios_dinr9_din9 DIN9 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr10 MDIOSDINR10 MDIOS input data register 10
@{*/


#define MDIOS_MDIOS_DINR10_DIN10_SHIFT		0
#define MDIOS_MDIOS_DINR10_DIN10_MASK		0xffff
/** @defgroup mdios_mdios_dinr10_din10 DIN10 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr11 MDIOSDINR11 MDIOS input data register 11
@{*/


#define MDIOS_MDIOS_DINR11_DIN11_SHIFT		0
#define MDIOS_MDIOS_DINR11_DIN11_MASK		0xffff
/** @defgroup mdios_mdios_dinr11_din11 DIN11 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr12 MDIOSDINR12 MDIOS input data register 12
@{*/


#define MDIOS_MDIOS_DINR12_DIN12_SHIFT		0
#define MDIOS_MDIOS_DINR12_DIN12_MASK		0xffff
/** @defgroup mdios_mdios_dinr12_din12 DIN12 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr13 MDIOSDINR13 MDIOS input data register 13
@{*/


#define MDIOS_MDIOS_DINR13_DIN13_SHIFT		0
#define MDIOS_MDIOS_DINR13_DIN13_MASK		0xffff
/** @defgroup mdios_mdios_dinr13_din13 DIN13 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr14 MDIOSDINR14 MDIOS input data register 14
@{*/


#define MDIOS_MDIOS_DINR14_DIN14_SHIFT		0
#define MDIOS_MDIOS_DINR14_DIN14_MASK		0xffff
/** @defgroup mdios_mdios_dinr14_din14 DIN14 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr15 MDIOSDINR15 MDIOS input data register 15
@{*/


#define MDIOS_MDIOS_DINR15_DIN15_SHIFT		0
#define MDIOS_MDIOS_DINR15_DIN15_MASK		0xffff
/** @defgroup mdios_mdios_dinr15_din15 DIN15 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

