grevaillot/svd_tools/headers/STM32F7x9/mdios.h
/** @defgroup mdios_mdios_dinr16 MDIOSDINR16 MDIOS input data register 16
@{*/


#define MDIOS_MDIOS_DINR16_DIN16_SHIFT		0
#define MDIOS_MDIOS_DINR16_DIN16_MASK		0xffff
/** @defgroup mdios_mdios_dinr16_din16 DIN16 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr17 MDIOSDINR17 MDIOS input data register 17
@{*/


#define MDIOS_MDIOS_DINR17_DIN17_SHIFT		0
#define MDIOS_MDIOS_DINR17_DIN17_MASK		0xffff
/** @defgroup mdios_mdios_dinr17_din17 DIN17 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr18 MDIOSDINR18 MDIOS input data register 18
@{*/


#define MDIOS_MDIOS_DINR18_DIN18_SHIFT		0
#define MDIOS_MDIOS_DINR18_DIN18_MASK		0xffff
/** @defgroup mdios_mdios_dinr18_din18 DIN18 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr19 MDIOSDINR19 MDIOS input data register 19
@{*/


#define MDIOS_MDIOS_DINR19_DIN19_SHIFT		0
#define MDIOS_MDIOS_DINR19_DIN19_MASK		0xffff
/** @defgroup mdios_mdios_dinr19_din19 DIN19 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr20 MDIOSDINR20 MDIOS input data register 20
@{*/


#define MDIOS_MDIOS_DINR20_DIN20_SHIFT		0
#define MDIOS_MDIOS_DINR20_DIN20_MASK		0xffff
/** @defgroup mdios_mdios_dinr20_din20 DIN20 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr21 MDIOSDINR21 MDIOS input data register 21
@{*/


#define MDIOS_MDIOS_DINR21_DIN21_SHIFT		0
#define MDIOS_MDIOS_DINR21_DIN21_MASK		0xffff
/** @defgroup mdios_mdios_dinr21_din21 DIN21 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr22 MDIOSDINR22 MDIOS input data register 22
@{*/


#define MDIOS_MDIOS_DINR22_DIN22_SHIFT		0
#define MDIOS_MDIOS_DINR22_DIN22_MASK		0xffff
/** @defgroup mdios_mdios_dinr22_din22 DIN22 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr23 MDIOSDINR23 MDIOS input data register 23
@{*/


#define MDIOS_MDIOS_DINR23_DIN23_SHIFT		0
#define MDIOS_MDIOS_DINR23_DIN23_MASK		0xffff
/** @defgroup mdios_mdios_dinr23_din23 DIN23 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr24 MDIOSDINR24 MDIOS input data register 24
@{*/


#define MDIOS_MDIOS_DINR24_DIN24_SHIFT		0
#define MDIOS_MDIOS_DINR24_DIN24_MASK		0xffff
/** @defgroup mdios_mdios_dinr24_din24 DIN24 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr25 MDIOSDINR25 MDIOS input data register 25
@{*/


#define MDIOS_MDIOS_DINR25_DIN25_SHIFT		0
#define MDIOS_MDIOS_DINR25_DIN25_MASK		0xffff
/** @defgroup mdios_mdios_dinr25_din25 DIN25 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr26 MDIOSDINR26 MDIOS input data register 26
@{*/


#define MDIOS_MDIOS_DINR26_DIN26_SHIFT		0
#define MDIOS_MDIOS_DINR26_DIN26_MASK		0xffff
/** @defgroup mdios_mdios_dinr26_din26 DIN26 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr27 MDIOSDINR27 MDIOS input data register 27
@{*/


#define MDIOS_MDIOS_DINR27_DIN27_SHIFT		0
#define MDIOS_MDIOS_DINR27_DIN27_MASK		0xffff
/** @defgroup mdios_mdios_dinr27_din27 DIN27 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr28 MDIOSDINR28 MDIOS input data register 28
@{*/


#define MDIOS_MDIOS_DINR28_DIN28_SHIFT		0
#define MDIOS_MDIOS_DINR28_DIN28_MASK		0xffff
/** @defgroup mdios_mdios_dinr28_din28 DIN28 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr29 MDIOSDINR29 MDIOS input data register 29
@{*/


#define MDIOS_MDIOS_DINR29_DIN29_SHIFT		0
#define MDIOS_MDIOS_DINR29_DIN29_MASK		0xffff
/** @defgroup mdios_mdios_dinr29_din29 DIN29 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr30 MDIOSDINR30 MDIOS input data register 30
@{*/


#define MDIOS_MDIOS_DINR30_DIN30_SHIFT		0
#define MDIOS_MDIOS_DINR30_DIN30_MASK		0xffff
/** @defgroup mdios_mdios_dinr30_din30 DIN30 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_dinr31 MDIOSDINR31 MDIOS input data register 31
@{*/


#define MDIOS_MDIOS_DINR31_DIN31_SHIFT		0
#define MDIOS_MDIOS_DINR31_DIN31_MASK		0xffff
/** @defgroup mdios_mdios_dinr31_din31 DIN31 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr0 MDIOSDOUTR0 MDIOS output data register 0
@{*/


#define MDIOS_MDIOS_DOUTR0_DOUT0_SHIFT		0
#define MDIOS_MDIOS_DOUTR0_DOUT0_MASK		0xffff
/** @defgroup mdios_mdios_doutr0_dout0 DOUT0 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr1 MDIOSDOUTR1 MDIOS output data register 1
@{*/


#define MDIOS_MDIOS_DOUTR1_DOUT1_SHIFT		0
#define MDIOS_MDIOS_DOUTR1_DOUT1_MASK		0xffff
/** @defgroup mdios_mdios_doutr1_dout1 DOUT1 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr2 MDIOSDOUTR2 MDIOS output data register 2
@{*/


#define MDIOS_MDIOS_DOUTR2_DOUT2_SHIFT		0
#define MDIOS_MDIOS_DOUTR2_DOUT2_MASK		0xffff
/** @defgroup mdios_mdios_doutr2_dout2 DOUT2 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr3 MDIOSDOUTR3 MDIOS output data register 3
@{*/


#define MDIOS_MDIOS_DOUTR3_DOUT3_SHIFT		0
#define MDIOS_MDIOS_DOUTR3_DOUT3_MASK		0xffff
/** @defgroup mdios_mdios_doutr3_dout3 DOUT3 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr4 MDIOSDOUTR4 MDIOS output data register 4
@{*/


#define MDIOS_MDIOS_DOUTR4_DOUT4_SHIFT		0
#define MDIOS_MDIOS_DOUTR4_DOUT4_MASK		0xffff
/** @defgroup mdios_mdios_doutr4_dout4 DOUT4 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr5 MDIOSDOUTR5 MDIOS output data register 5
@{*/


