grevaillot/svd_tools/headers/STM32F7x9/mdios.h
#define MDIOS_MDIOS_DOUTR5_DOUT5_SHIFT		0
#define MDIOS_MDIOS_DOUTR5_DOUT5_MASK		0xffff
/** @defgroup mdios_mdios_doutr5_dout5 DOUT5 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr6 MDIOSDOUTR6 MDIOS output data register 6
@{*/


#define MDIOS_MDIOS_DOUTR6_DOUT6_SHIFT		0
#define MDIOS_MDIOS_DOUTR6_DOUT6_MASK		0xffff
/** @defgroup mdios_mdios_doutr6_dout6 DOUT6 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr7 MDIOSDOUTR7 MDIOS output data register 7
@{*/


#define MDIOS_MDIOS_DOUTR7_DOUT7_SHIFT		0
#define MDIOS_MDIOS_DOUTR7_DOUT7_MASK		0xffff
/** @defgroup mdios_mdios_doutr7_dout7 DOUT7 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr8 MDIOSDOUTR8 MDIOS output data register 8
@{*/


#define MDIOS_MDIOS_DOUTR8_DOUT8_SHIFT		0
#define MDIOS_MDIOS_DOUTR8_DOUT8_MASK		0xffff
/** @defgroup mdios_mdios_doutr8_dout8 DOUT8 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr9 MDIOSDOUTR9 MDIOS output data register 9
@{*/


#define MDIOS_MDIOS_DOUTR9_DOUT9_SHIFT		0
#define MDIOS_MDIOS_DOUTR9_DOUT9_MASK		0xffff
/** @defgroup mdios_mdios_doutr9_dout9 DOUT9 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr10 MDIOSDOUTR10 MDIOS output data register 10
@{*/


#define MDIOS_MDIOS_DOUTR10_DOUT10_SHIFT		0
#define MDIOS_MDIOS_DOUTR10_DOUT10_MASK		0xffff
/** @defgroup mdios_mdios_doutr10_dout10 DOUT10 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr11 MDIOSDOUTR11 MDIOS output data register 11
@{*/


#define MDIOS_MDIOS_DOUTR11_DOUT11_SHIFT		0
#define MDIOS_MDIOS_DOUTR11_DOUT11_MASK		0xffff
/** @defgroup mdios_mdios_doutr11_dout11 DOUT11 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr12 MDIOSDOUTR12 MDIOS output data register 12
@{*/


#define MDIOS_MDIOS_DOUTR12_DOUT12_SHIFT		0
#define MDIOS_MDIOS_DOUTR12_DOUT12_MASK		0xffff
/** @defgroup mdios_mdios_doutr12_dout12 DOUT12 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr13 MDIOSDOUTR13 MDIOS output data register 13
@{*/


#define MDIOS_MDIOS_DOUTR13_DOUT13_SHIFT		0
#define MDIOS_MDIOS_DOUTR13_DOUT13_MASK		0xffff
/** @defgroup mdios_mdios_doutr13_dout13 DOUT13 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr14 MDIOSDOUTR14 MDIOS output data register 14
@{*/


#define MDIOS_MDIOS_DOUTR14_DOUT14_SHIFT		0
#define MDIOS_MDIOS_DOUTR14_DOUT14_MASK		0xffff
/** @defgroup mdios_mdios_doutr14_dout14 DOUT14 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr15 MDIOSDOUTR15 MDIOS output data register 15
@{*/


#define MDIOS_MDIOS_DOUTR15_DOUT15_SHIFT		0
#define MDIOS_MDIOS_DOUTR15_DOUT15_MASK		0xffff
/** @defgroup mdios_mdios_doutr15_dout15 DOUT15 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr16 MDIOSDOUTR16 MDIOS output data register 16
@{*/


#define MDIOS_MDIOS_DOUTR16_DOUT16_SHIFT		0
#define MDIOS_MDIOS_DOUTR16_DOUT16_MASK		0xffff
/** @defgroup mdios_mdios_doutr16_dout16 DOUT16 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr17 MDIOSDOUTR17 MDIOS output data register 17
@{*/


#define MDIOS_MDIOS_DOUTR17_DOUT17_SHIFT		0
#define MDIOS_MDIOS_DOUTR17_DOUT17_MASK		0xffff
/** @defgroup mdios_mdios_doutr17_dout17 DOUT17 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr18 MDIOSDOUTR18 MDIOS output data register 18
@{*/


#define MDIOS_MDIOS_DOUTR18_DOUT18_SHIFT		0
#define MDIOS_MDIOS_DOUTR18_DOUT18_MASK		0xffff
/** @defgroup mdios_mdios_doutr18_dout18 DOUT18 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr19 MDIOSDOUTR19 MDIOS output data register 19
@{*/


#define MDIOS_MDIOS_DOUTR19_DOUT19_SHIFT		0
#define MDIOS_MDIOS_DOUTR19_DOUT19_MASK		0xffff
/** @defgroup mdios_mdios_doutr19_dout19 DOUT19 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr20 MDIOSDOUTR20 MDIOS output data register 20
@{*/


#define MDIOS_MDIOS_DOUTR20_DOUT20_SHIFT		0
#define MDIOS_MDIOS_DOUTR20_DOUT20_MASK		0xffff
/** @defgroup mdios_mdios_doutr20_dout20 DOUT20 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr21 MDIOSDOUTR21 MDIOS output data register 21
@{*/


#define MDIOS_MDIOS_DOUTR21_DOUT21_SHIFT		0
#define MDIOS_MDIOS_DOUTR21_DOUT21_MASK		0xffff
/** @defgroup mdios_mdios_doutr21_dout21 DOUT21 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr22 MDIOSDOUTR22 MDIOS output data register 22
@{*/


#define MDIOS_MDIOS_DOUTR22_DOUT22_SHIFT		0
#define MDIOS_MDIOS_DOUTR22_DOUT22_MASK		0xffff
/** @defgroup mdios_mdios_doutr22_dout22 DOUT22 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr23 MDIOSDOUTR23 MDIOS output data register 23
@{*/


#define MDIOS_MDIOS_DOUTR23_DOUT23_SHIFT		0
#define MDIOS_MDIOS_DOUTR23_DOUT23_MASK		0xffff
/** @defgroup mdios_mdios_doutr23_dout23 DOUT23 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr24 MDIOSDOUTR24 MDIOS output data register 24
@{*/


#define MDIOS_MDIOS_DOUTR24_DOUT24_SHIFT		0
#define MDIOS_MDIOS_DOUTR24_DOUT24_MASK		0xffff
/** @defgroup mdios_mdios_doutr24_dout24 DOUT24 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr25 MDIOSDOUTR25 MDIOS output data register 25
@{*/


#define MDIOS_MDIOS_DOUTR25_DOUT25_SHIFT		0
#define MDIOS_MDIOS_DOUTR25_DOUT25_MASK		0xffff
/** @defgroup mdios_mdios_doutr25_dout25 DOUT25 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

