grevaillot/svd_tools/headers/STM32F7x9/mdios.h
/** @defgroup mdios_mdios_doutr26 MDIOSDOUTR26 MDIOS output data register 26
@{*/


#define MDIOS_MDIOS_DOUTR26_DOUT26_SHIFT		0
#define MDIOS_MDIOS_DOUTR26_DOUT26_MASK		0xffff
/** @defgroup mdios_mdios_doutr26_dout26 DOUT26 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr27 MDIOSDOUTR27 MDIOS output data register 27
@{*/


#define MDIOS_MDIOS_DOUTR27_DOUT27_SHIFT		0
#define MDIOS_MDIOS_DOUTR27_DOUT27_MASK		0xffff
/** @defgroup mdios_mdios_doutr27_dout27 DOUT27 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr28 MDIOSDOUTR28 MDIOS output data register 28
@{*/


#define MDIOS_MDIOS_DOUTR28_DOUT28_SHIFT		0
#define MDIOS_MDIOS_DOUTR28_DOUT28_MASK		0xffff
/** @defgroup mdios_mdios_doutr28_dout28 DOUT28 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr29 MDIOSDOUTR29 MDIOS output data register 29
@{*/


#define MDIOS_MDIOS_DOUTR29_DOUT29_SHIFT		0
#define MDIOS_MDIOS_DOUTR29_DOUT29_MASK		0xffff
/** @defgroup mdios_mdios_doutr29_dout29 DOUT29 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr30 MDIOSDOUTR30 MDIOS output data register 30
@{*/


#define MDIOS_MDIOS_DOUTR30_DOUT30_SHIFT		0
#define MDIOS_MDIOS_DOUTR30_DOUT30_MASK		0xffff
/** @defgroup mdios_mdios_doutr30_dout30 DOUT30 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_mdios_doutr31 MDIOSDOUTR31 MDIOS output data register 31
@{*/


#define MDIOS_MDIOS_DOUTR31_DOUT31_SHIFT		0
#define MDIOS_MDIOS_DOUTR31_DOUT31_MASK		0xffff
/** @defgroup mdios_mdios_doutr31_dout31 DOUT31 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/
